---
kind: property
id: P:Autodesk.Revit.DB.ExportLineweightTable.IsValidObject
source: html/53a729f4-826a-357b-59af-1d39e32ba88f.htm
---
# Autodesk.Revit.DB.ExportLineweightTable.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.